# Len

## Description
Function Len returns the length of the specified string value.

```pascal
FUNCTION Len(v : DYNARRAY[] of CHAR) : INTEGER;
```

```python

def vs.Len(v):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|v|DYNARRAY[] of CHAR|Source string.|

## Version
Availability: from MiniCAD
## Category
* Strings